function myFunction() {
  var x = document.getElementById("mymenu");
  if (x.style.display === "block") {
    x.style.display = "none";
  } else {
    x.style.display = "block";
  }
}
function dropFunction() {
  document.getElementById("myDropdown").classList.toggle("show");
}

// Close the dropdown if the user clicks outside of it
window.onclick = function(event) {
  if (!event.target.matches('.dropbtn')) {
    var dropdowns = document.getElementsByClassName("dropdown-content");
    var i;
    for (i = 0; i < dropdowns.length; i++) {
      var openDropdown = dropdowns[i];
      if (openDropdown.classList.contains('show')) {
        openDropdown.classList.remove('show');
      }
    }
  }
}
function chanFunction() {
  var inpObj1 = document.getElementById("val1");

  var inpObj2 = document.getElementById("val2");
  if (inpObj1.value=="honi") {
    switch (inpObj2.value) {
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "uher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "iher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "melhii":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "arslan":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "jinluur":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "hilents":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "num":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "matar":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "humh":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "zagas":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
   }
 }
  if (inpObj1.value=="uher") {
    switch (inpObj2.value) {
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "uher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "iher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "melhii":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "arslan":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "ohin":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "jinluur":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "hilents":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "num":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "matar":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "humh":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "zagas":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");

   } 
 }
  if (inpObj1.value=="iher") {
    switch (inpObj2.value) {
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "uher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "iher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "melhii":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "arslan":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "ohin":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "jinluur":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "hilents":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "num":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "matar":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "humh":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "zagas":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");

}
   } 
  if (inpObj1.value=="melhii") {
    switch (inpObj2.value) {
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "uher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "iher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "melhii":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "arslan":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "ohin":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "jinluur":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "hilents":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "num":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "matar":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "humh":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "zagas":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    
}
   } 
  if (inpObj1.value=="arslan") {
    switch (inpObj2.value) {
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "uher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "iher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "melhii":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "arslan":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "jinluur":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "hilents":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "num":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "matar":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "humh":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "zagas":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
  
}
   } 
  if (inpObj1.value=="ohin") {
    switch (inpObj2.value) {
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "uher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "iher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "melhii":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "arslan":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "jinluur":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "hilents":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "num":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "matar":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "humh":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "zagas":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    
   } 
 }
  if (inpObj1.value=="jinluur") {
    switch (inpObj2.value) {
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "uher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "iher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "melhii":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "arslan":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "jinluur":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "hilents":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "num":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "matar":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "humh":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "zagas":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");

   } 
 }
  if (inpObj1.value=="hilents") {
    switch (inpObj2.value) {
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "uher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "iher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "melhii":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "arslan":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "jinluur":
    day = "Friday";
    break;
  case "hilents":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "num":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "matar":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "humh":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "zagas":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");

}
   } 
  if (inpObj1.value=="num") {
    switch (inpObj2.value) {
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "uher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "iher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "melhii":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "arslan":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "jinluur":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "hilents":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "num":
    alert("Бусдын атаархлыг төрүүлж чаддаг сайхан хосууд байдаг. Мөнгө, нэр төр тэдэнд тийм ч чухал биш зөвхөн өөрийг нь жаргалтай байлгах хүнийг л сонгодог болохоор хэзээ ч бүр мөсөн салдаггүй. Ихэнх нь муудсан ч эргээд заавал нийлдэг хувь тавилангаараа холбогдсон хосууд байдаг.");
    break;
  case "matar":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "humh":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "zagas":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");

}
   } 
  if (inpObj1.value=="matar") {
    switch (inpObj2.value) {
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "uher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "iher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "melhii":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "arslan":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "jinluur":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "hilents":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "num":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "matar":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "humh":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "zagas":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
}
   } 
  if (inpObj1.value=="zagas") {
    switch (inpObj2.value) {
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "uher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "iher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "melhii":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "arslan":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "ohin":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "jinluur":
    alert("Өөрсдийн харилцаагаа сайн мэддэг хосууд. Тэдний харилцаа том асуудалтай болсон ч хамтдаа ярилцаж түүнийг заавал давдаг. Жижигхэн зүйлийг том болголгүй шулуухан хурдан харилцаагаа бэхжүүлэх авдаг хүчирхэг хосууд байдаг.");
    break;
  case "hilents":
    alert("Бусдын атаархлыг төрүүлж чаддаг сайхан хосууд байдаг. Мөнгө, нэр төр тэдэнд тийм ч чухал биш зөвхөн өөрийг нь жаргалтай байлгах хүнийг л сонгодог болохоор хэзээ ч бүр мөсөн салдаггүй. Ихэнх нь муудсан ч эргээд заавал нийлдэг хувь тавилангаараа холбогдсон хосууд байдаг.");
    break;
  case "num":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "matar":
    alert("Тэд гүн дурладаг ордуудын зохицол. Ямар ч ээдрээтэй зүйл байсан эмэгтэй нь тэвчиж хайраа улам бэхжүүлнэ. Гэрлэх гэж яардаггүй, аль аль байр сууриа олсон цагт гэр бүл болдог. Ихэнх нь үерхлийн ямар нэг тэмдэглэлт өдрийг марталгүй тэмдэглэдэг хосууд.");
    break;
  case "humh":
    alert("Өөрсдийн харилцаагаа сайн мэддэг хосууд. Тэдний харилцаа том асуудалтай болсон ч хамтдаа ярилцаж түүнийг заавал давдаг. Жижигхэн зүйлийг том болголгүй шулуухан хурдан харилцаагаа бэхжүүлэх авдаг хүчирхэг хосууд байдаг.");
    break;
  case "zagas":
    alert("Бусдын атаархлыг төрүүлж чаддаг сайхан хосууд байдаг. Мөнгө, нэр төр тэдэнд тийм ч чухал биш зөвхөн өөрийг нь жаргалтай байлгах хүнийг л сонгодог болохоор хэзээ ч бүр мөсөн салдаггүй. Ихэнх нь муудсан ч эргээд заавал нийлдэг хувь тавилангаараа холбогдсон хосууд байдаг.");
}
   } 

  if (inpObj1.value=="humh") {
    switch (inpObj2.value) {
  case "honi":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "uher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "iher":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "melhii":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "arslan":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "ohin":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "jinluur":
    alert("Өөрсдийн харилцаагаа сайн мэддэг хосууд. Тэдний харилцаа том асуудалтай болсон ч хамтдаа ярилцаж түүнийг заавал давдаг. Жижигхэн зүйлийг том болголгүй шулуухан хурдан харилцаагаа бэхжүүлэх авдаг хүчирхэг хосууд байдаг.");
    break;
  case "hilents":
    alert("Бусдын атаархлыг төрүүлж чаддаг сайхан хосууд байдаг. Мөнгө, нэр төр тэдэнд тийм ч чухал биш зөвхөн өөрийг нь жаргалтай байлгах хүнийг л сонгодог болохоор хэзээ ч бүр мөсөн салдаггүй. Ихэнх нь муудсан ч эргээд заавал нийлдэг хувь тавилангаараа холбогдсон хосууд байдаг.");
    break;
  case "num":
    alert("Тэд их эмзэг, бие биедээ эрхлэх дуртай. Муудсан ч амархан инээгээд мартчихдаг. Тэд хайртынхаа төлөө юу ч хийхэд бэлэн гайхалтай хосууд байдаг. Тэдэнд найзууд нь юу ч гэж хэлсэн зөвхөн сэтгэлээ дагадаг болохоор үерхлийг бүрэн утгаар харуулж чадна.");
    break;
  case "matar":
    alert("Тэд гүн дурладаг ордуудын зохицол. Ямар ч ээдрээтэй зүйл байсан эмэгтэй нь тэвчиж хайраа улам бэхжүүлнэ. Гэрлэх гэж яардаггүй, аль аль байр сууриа олсон цагт гэр бүл болдог. Ихэнх нь үерхлийн ямар нэг тэмдэглэлт өдрийг марталгүй тэмдэглэдэг хосууд.");
    break;
  case "humh":
    alert("Өөрсдийн харилцаагаа сайн мэддэг хосууд. Тэдний харилцаа том асуудалтай болсон ч хамтдаа ярилцаж түүнийг заавал давдаг. Жижигхэн зүйлийг том болголгүй шулуухан хурдан харилцаагаа бэхжүүлэх авдаг хүчирхэг хосууд байдаг.");
    break;
  case "zagas":
    alert("Бусдын атаархлыг төрүүлж чаддаг сайхан хосууд байдаг. Мөнгө, нэр төр тэдэнд тийм ч чухал биш зөвхөн өөрийг нь жаргалтай байлгах хүнийг л сонгодог болохоор хэзээ ч бүр мөсөн салдаггүй. Ихэнх нь муудсан ч эргээд заавал нийлдэг хувь тавилангаараа холбогдсон хосууд байдаг.");
}
   } 

}